In [5]:
import pandas as pd
df=pd.DataFrame({'name':['a', 'b', 'c', 'd', 'a', 'b', 'a', 'b', 'a', 'c', 'c', 'd'],
                's1':[11,12,22,11,23,14,21,12,23,14,15,16],'s2':[21,22,23,23,23,21,24,25,26,27,23,28]})
df

   name  s1  s2
0     a  11  21
1     b  12  22
2     c  22  23
3     d  11  23
4     a  23  23
5     b  14  21
6     a  21  24
7     b  12  25
8     a  23  26
9     c  14  27
10    c  15  23
11    d  16  28

In [9]:
df1=df.groupby('name')
df1

In [10]:
for x,y in df1:
    print(x)
    print(y)
    print()

a
  name  s1  s2
0    a  11  21
4    a  23  23
6    a  21  24
8    a  23  26

b
  name  s1  s2
1    b  12  22
5    b  14  21
7    b  12  25

c
   name  s1  s2
2     c  22  23
9     c  14  27
10    c  15  23

d
   name  s1  s2
3     d  11  23
11    d  16  28

In [11]:
df1.get_group('a')

  name  s1  s2
0    a  11  21
4    a  23  23
6    a  21  24
8    a  23  26

In [12]:
df1.min()

      s1  s2
name
a     11  21
b     12  21
c     14  23
d     11  23

In [13]:
df1.max()

      s1  s2
name
a     23  26
b     14  25
c     22  27
d     16  28

In [14]:
df1.mean()

             s1         s2
name
a     19.500000  23.500000
b     12.666667  22.666667
c     17.000000  24.333333
d     13.500000  25.500000

In [15]:
df1.std()

            s1        s2
name
a     5.744563  2.081666
b     1.154701  2.081666
c     4.358899  2.309401
d     3.535534  3.535534

In [17]:
li=list(df1)
li

[('a',
    name  s1  s2
  0    a  11  21
  4    a  23  23
  6    a  21  24
  8    a  23  26),
 ('b',
    name  s1  s2
  1    b  12  22
  5    b  14  21
  7    b  12  25),
 ('c',
     name  s1  s2
  2     c  22  23
  9     c  14  27
  10    c  15  23),
 ('d',
     name  s1  s2
  3     d  11  23
  11    d  16  28)]